{
    "source": "Hepcidin: inﬂammation’s iron curtain",
    "authors": [
        "H. MCGRATH JR",
        "P. G. RIGBY1"
    ],
    "journal": "Rheumatology",
    "publicationDate": "2004-07-27",
    "documentId": "Document_12024-04-11 11:26:33",
    "text": "Advance Access publication 27 July 2004\nEditorial\nHepcidin: inﬂammation’s iron curtain\n\n\n\n\n \nRheumatologists and their patients are the beneﬁciaries of a recently identiﬁed peptide, hepcidin (Table 1). Isolated from human urine and plasma in the year 2000 [1, 2], hepcidin appears\n \nTABLE 1. Dynamics of iron and hepcidin regulation\n\nAfferent: blood !\tLiver !\tEfferent: gut\n \nto be the long-sought iron-regulatory hormone responsible for the anaemia of chronic disease [3, 4]. It is more than that: it is an acute-\n \nStimulation or down-regulation\n \nHepcidin production\n \nAction on iron absorption in gut and immunity\n \nphase reactant, responding to infection and inﬂammation [5]; it is\nan antimicrobial peptide that disrupts microbial membranes [1, 6]; and it provides an iron-restricted internal milieu inhospitable to microbes [7, 8].\nHepcidin is a 25 amino acid, 2–3 kDa, cationic peptide that has broad antibacterial and antifungal actions [1]. In concert with other antimicrobial peptides, known as defensins and cathelicidins [9], it provides a ﬁrst line of defence at mucosal barriers [1, 2]. However, more germane for rheumatologists is its control of iron kinetics. Produced by hepatocytes, hepcidin inhibits the intestinal absorption [1, 10], macrophage release [3, 7] and placental passage\n[10] of iron. Hepcidin mRNA moves with the body’s iron levels, increasing as they increase and decreasing as they decrease [11]. More pertinently, hepcidin rises with infection or inﬂammation and falls with hypoxia or anaemia [12].\nThe anaemia of chronic disease has long confounded physicians. It is generally normocytic and normochromic, but may be hypo- chromic or microcytic [13]. The low serum iron and normal-to- low iron-binding capacity, in conjunction with a high-to-normal serum ferritin level in patients with inﬂammatory disease, has been perplexing. Also notable has been the shortened red blood cell survival and blunted erythropoietin-induced production of red blood cells. At one time known as the anaemia of infection, it became known, after man’s entry into the age of antibiotics, as the anaemia of chronic disease, and now, perhaps more aptly, it is the anaemia of inﬂammation.\nIron can be toxic. It catalyses the generation of reactive free\nradicals [14] and activates NF-KB, the prototypic transcription factor for genes involved in inﬂammation [15]. At high levels, iron is damaging to tissues. Humans need little dietary iron, 1–2 mg a day sufﬁcing for the average adult male [16]. However, mammals lack a regulated pathway for iron excretion [12], so iron absorption has to be tightly regulated. Hepcidin acts as a negative regulator of iron absorption: USF2 knockout mice lacking hepcidin mRNA become iron-overloaded [17]; transgenic mice with increased hepcidin expression die at birth with severe iron deﬁciency [10]; humans with hepcidin-producing adenomas develop an iron-refractory iron deﬁciency anaemia [4]; and gene mutations affecting hepcidin cause haemochromatosis in humans [18] and in mouse models [17].\nIn animals and man, the anaemia of inﬂammation is due primarily to hepcidin-induced sequestration of iron in the macro- phage [18]. The link between inﬂammation/infection and liver production of hepcidin is attributed to IL-6, produced at sites of infection/inﬂammation [13]. Human hepatocytes increase hepcidin mRNA in the presence of IL-6 or lipopolysaccharide and in the presence of IL-6 produced by monocytes exposed to lipopolysac- charide [5]. Infection in one human subject reportedly increased excretion of hepcidin in the urine 100-fold [5]. Mice respond to the inﬂammation generated by an injection of turpentine with a six- fold increase in hepcidin mRNA and a two-fold decrease in serum iron [10]. Remarkably, the white bass responds to infection with Streptococcus iniae with a 4500-fold rise in hepcidin mRNA expression [19].\n1323\n \n1.\tInﬂammation/infection\t\"\t# intake of Fe by gut\n\" IL-6\tAntibacterial in innate\nimmunity Sequestration of Fe in\nmacrophages reduces serum Fe\n2.\tBody Fe \"\t\"\t# intake of Fe by gut Haemochromatosis\nHaemosiderosis\n3.\tBody Fe #\t#\t\" intake of Fe by gut\nBleeding\tEgress of Fe out of\nmacrophage\n4.\tAnaemia, hypoxaemia\t#\t\" intake of Fe by gut\n5.\tErythropoiesis \"\t#\t\" intake of Fe by gut\n\n\n\nIn addition to iron levels and inﬂammation/infection, there is another factor that affects hepcidin levels: it is anaemia. Along with hypoxia, anaemia overrides the effects of iron and inﬂammation/infection, reducing levels of hepcidin mRNA [4, 12]. Were this not the case, inﬂammation, by maintaining high hepcidin levels, would keep the haematocrit dropping. Instead, down- regulation of hepcidin mRNA expression by anaemia produces a new steady state, usually with haematocrits 3–5 points below normal.\nIn addition to disrupting bacterial membranes, hepcidin provides an inhospitable internal milieu for microbes that success- fully enter the bloodstream. Micro-organisms need iron [14]. Bacteria require iron for the production of the superoxide dismutase that protects them from host oxygen radicals [20, 21]. Hepcidin, by inducing macrophage sequestration of iron, robs bacteria of this element. Blood and intracellular bacteria [22] may weaken; bioﬁlms may not develop [7]. Pertinent here is the recent report of an inverse relationship between the incidence of tuberculosis and rheumatoid arthritis (RA) [23], raising the possibility that that the inaccessibility of iron in RA protects from tuberculosis [24].\nPallor, weakness and fatigue have been recognized as hallmarks of chronic disease for millennia. Anaemia obviously contributes to the pallor. Less obvious is whether the decrease in serum iron diminishes its availability to myoglobin and the enzymes catalysing the redox reactions required for the generation of energy (cyto- chromes) sufﬁciently to contribute to weakness and fatigue.\nDefensins are antimicrobial peptides produced by cells of epithelial linings [9]. Hepcidin, like defensins, is an antimicrobial peptide that kills on contact. However, because it is produced by the liver, has not been found to have chemotactic properties, and differs structurally from defensins [25], it will likely be classiﬁed as an acute-phase reactant [5].\nThe identiﬁcation of hepcidin opens the door to therapeutic approaches for several disorders and to proscriptions regarding the use of iron. Recombinant hepcidin may be the ideal therapeutic agent for those with some forms of juvenile haemochromatosis and\n \nRheumatology Vol. 43 No. 11 © British Society for Rheumatology 2004; all rights reserved\n \n\n \nwith the less severe but more common form of haemochromatosis caused by mutations in the HFE gene [26]. Hepcidin-induced iron deprivation may prove helpful in preventing the development of resistant bacterial bioﬁlms [10]. For the anaemia of inﬂamma- tion, often resistant to erythropoietin therapy [27], inhibitors of hepcidin, by releasing sequestered iron, could restore haemo- globin levels and conceivably correct an iron lack in myoglobin and cytochromes as well. Finally, of related interest is a recent report that moderate alcohol intake reduces levels of C-reactive protein and IL-6 [28], the principle chemokine for the generation of hepcidin mRNA, extrapolating to a possible ameliorative role of alcohol in both inﬂammation and the anaemia of inﬂammation.\nAs to proscriptions, iron supplements should be monitored, not only because the resulting increase in hepcidin can fuel antimicro- bial engines unnecessarily, but because hepcidin increases macro- phage iron sequestration in the synovium as elsewhere. Synovial iron has the propensity to generate oxygen free radicals that have been linked to the chronicity and erosiveness of joint disease in RA [29]. In fact, intramuscular injections of iron have long ago been reported to cause acute ﬂares of joint inﬂammation in RA [30]. A broader phlogistic potential of iron towards the joint comes from a recent report that iron depletion by serial phlebotomies diminishes recurrences of gouty arthritis [31]. If one adds all of the above to the reported links of iron sufﬁciency to colon cancer [32], diabetes mellitus [33], chronic hepatitis [34] and atherosclerosis [35], it would seem best to phase out gratuitous iron supplementation altogether.\nThe discovery of hepcidin provides a thread that ties together the perplexing triad of decreased serum iron, increased macro- phage iron and chronic inﬂammation. In addition, it offers a unique opportunity for determining the effects of iron on disease, the usefulness of hepcidin inhibitors or promoters to control iron kinetics, and the proper means of iron administration. In the aggregate, these will represent a step forward in the treatment of a variety of diseases.\nThe authors have declared no conﬂicts of interest.\n\nH. MCGRATH JR and P. G. RIGBY1\nLouisiana State Health Sciences Center, Department of Medicine, Section of Rheumatology, 1542 Tulane Avenue, New Orleans, LA 70112 and 1Department of Medicine, Section of Hematology, Chancellors Ofﬁce, Resource Center, 433 Bolivar Street, New Orleans, LA 70112, USA\nCorrespondence to: H. McGrath. E-mail: hmcgra@lsuhsc.edu\n\n\nReferences\n1.\tPark CH, Valore EV, Waring AJ, Ganz T. Hepcidin, a urinary antimicrobial peptide synthesized in the liver. J Biol Chem 2001; 276:7806–10.\n2.\tKrause A, Neitz S, Magert HJ et al. LEAP-1, a novel highly disulﬁde-bonded human peptide, exhibits antimicrobial activity. FEBS Lett 2000;480:147–50.\n3.\tFleming RE, Sly WS. Hepcidin: a putative iron regulatory hormone relative to hereditary hemochromatosis and the anemia of chronic disease. Proc Natl Acad Sci USA 2001;98:8160–2.\n4.\tWeinstein DA, Roy CN, Fleming MD, Loda MF, Wolfsdorf JI, Andrews NC. Inappropriate expression of hepcidin is associated with iron refractory anemia: implications for anemia of chronic disease. Blood 2002;100:3776–81.\n5.\tNemeth E, Valore EV, Territo M, Schiller G, Lichenstein A, Ganz T. Hepcidin, a putative mediator of anemia of inﬂammation, is a type II acute-phase protein. Blood 2003;101:2461–3.\n \n6.\tZasloff M. Antibiotic peptides as mediators of innate immunity. Curr Opin Immunol 1992;4:3–7.\n7.\tSingh PK, Parsek MR, Greenberg EP, Welsh MJ. A component of innate immunity prevents bacterial bioﬁlm development. Nature 2002;417:552–5.\n8.\tJurado RL. Iron, infections, and the anemia of inﬂammation. Clin Infect Dis 1997;25:888–95.\n9.\tRisso A. Leukocyte antimicrobial peptides: multifunctional effector molecules of innate immunity. J Leukoc Biol 2000;68:785–92.\n10.\tNicolas G, Bennoun M, Porteu A et al. Severe iron deﬁciency anemia in transgenic mice expressing liver hepcidin. Proc Natl Acad Sci USA 2002;99:4596–601.\n11.\tPigeon C, Llyin G, Courselaud B et al. A new mouse liver-speciﬁc gene, encoding a protein homologous to human antimicrobial peptide hepcidin, is over expressed during iron overload. J Biol Chem 2001;276:7811–9.\n12.\tNicolas G, Chauvet C, Viatte L et al. The gene encoding the iron regulatory peptide hepcidin is regulated by anemia, hypoxia, and inﬂammation. J Clin Invest 2002;110:1037–44.\n13.\tErslev AJ. Anemia of chronic disease. In: Beutler E, Coller BS, Lichtman MA, Kipps TJ, Seligsohn U. Williams hematology. New York, NY: McGraw-Hill, 2001:481–6.\n14.\tAisen P, Enns C, Wessling-Resnick M. Chemistry and biology of eukaryotic iron metabolism. Int J Biochem Cell Biol 2001;33: 940–59.\n15.\tXiong S, She H, Takeuchi H et al. Signaling role of intracellular iron in NF-appaB activation. J Biol Chem 2003;278:17646–54.\n16.\tAndrews NC. Disorders of iron metabolism. N Engl J Med 1999;341:1986–96.\n17.\tCox TM, Halsall DJ. Hemochromatosis—neonatal and young subjects. Blood Cells Mol Dis 2002;29:411–7.\n18.\tNicolas G, Bennoun M, Devaux I et al. Lack of hepcidin gene expression and severe tissue iron overload in upstream stimulatory factor 2 (USF2) knockout mice. Proc Natl Acad Sci USA 2001; 98:8780–5.\n19.\tShike H, Lauth X, Westerman ME et al. Bass hepcidin is a novel antimicrobial peptide induced by bacterial challenge. Eur J Biochem 2002;269:2232–7.\n20.\tDey R, Datta SC Leishmanial glycosomes contain superoxide dismutase. Biochem J 1994;301:317–9.\n21.\tZhang Y, Lathigra R, Garbe T, Catty D, Young D. Genetic analysis of superoxide dismutase, the 23 kilodalton antigen of mycobacterium tuberculosis. Mol Microbiol 1991;5:381–91.\n22.\tKochan I. The role of iron in bacterial infections, with special considerations of host–tubercle bacillus interaction. Curr Top Microbiol Immunol 1973;60:1–30.\n23.\tRothschild BM, Rothschild C, Helbing M. Uniﬁed theory of the origins of erosive arthritis: conditioning as a protective/directing mechanism? J Rheumatol 2003;30:2095–102.\n24.\tMcGrath H Jr. Origins of erosive arthritis [letter]. J Rheumatol 2004;31:1463–4.\n25.\tHunter HN, Fulton DB, Ganz T, Vogel HJ. The solution structure of human hepcidin, a peptide hormone with antimicrobial activity that is involved in iron uptake and hereditary hemochromatosis. J Biol Chem 2002;277:37597–603.\n26.\tBrindle KR, Frazer DM, Wilkins SJ et al. Disrupted hepcidin regulation in HFE-associated haemochromatosis and the liver as a regulator of body iron hemoeostasis. Lancet 2003; 361: 669–73.\n27.\tBarany P. Inﬂammation, serum C-reactive protein, and erythropoie- tin resistance. Nephrol Dial Transplant 2001;16:224–7.\n28.\tVolpato S, Pahor M, Ferrucci L et al. Relationship of alcohol intake with inﬂammatory markers and plasminogen activator inhibitor-1 in well-functioning older adults: the Health, Aging, and Body Composition study. Circulation 2004;109:607–12.\n29.\tBlake DR, Gallagher PJ, Potter AR, Bell MJ, Bacon PA. The effect of synovial iron on the progression of rheumatoid disease. Arthritis Rheum 1984;27:495–501.\n \nEditorial\t1325\n \n\n30.\tBlake DR, Lunec J, Ahern M, Ring EF, Bradﬁeld J, Gutteridge JM. Effect of intravenous iron dextran on rheumatoid synovitis. Ann Rheum Dis 1985;44:18–28.\n31.\tFacchini FS. Near-iron deﬁciency-induced remission of gouty arthritis. Rheumatology 2003;42:1550–5.\n32.\tSullivan JL. Re: Association between hemochromatosis (HFE) gene mutation carrier status and the risk of colon cancer. Author reply. J Natl Cancer Inst 2003;95:829–30.\n \n"
}